#ifndef cw_data_center_h
#define cw_data_center_h

#include "typedef.h"

/// ----------------------------------------------------------------------------
/// @brief: 通道窗口的数据中心
/// ----------------------------------------------------------------------------
class cw_data_center
{
public:
	cw_data_center();
	virtual ~cw_data_center();

	/// ----------------------------------------------------------------------------

	/// ----------------------------------------------------------------------------
	/// @brief：		初始化
	/// @param: 	const sa_def::en_protocal_type & type - type
	/// @return: 	void - 无
	/// 			
	/// ----------------------------------------------------------------------------
	void init_(const sa_def::en_protocal_type& type);

	/// ----------------------------------------------------------------------------
	/// @brief：		获取UDP可用通道IP
	/// @return: 	int - 无
	/// 			-1 - 无可用通道
	///				其他 - 可用通道ID
	/// ----------------------------------------------------------------------------
	int get_udp_available_channel_id_();


private:

	sa_def::en_protocal_type pro_type_;
};



#endif /// cw_data_center_h